#+title: Projects

* PROJ Misc
** TODO Schedule haircut :Computer:
** TODO Find good time in schedule for regular climbing/workout :Computer:
** TODO Find/order power cable for record player :Computer:
** TODO Look for water filter replacements (probably in basement somewhere) :Home:
** DONE Bathe Ms. Puppy :Home:
** TODO Check for Aires MR review "requests" :Work:
   DEADLINE: <2026-06-29 Mon +1w>
   :PROPERTIES:
   :LAST_REPEAT: [2026-06-22 Mon 15:50]
   :END:
- State "DONE"       from "TODO"       [2026-06-22 Mon 15:50]
- State "DONE"       from "TODO"       [2026-06-17 Wed 14:14]
** WAIT [[https://mail.google.com/mail/u/0/#inbox/FMfcgzQgMVZKFShqgpxKPhRDQKnWCJvg][Projector]]
** TODO Cancel Fox One
   DEADLINE: <2026-07-15 Wed>
** TODO Listen to new Strokes album
   DEADLINE: <2026-06-24 Wed>
** TODO Liquidate money for Anne's credit card :Computer:
10k
** TODO Find lampshade :Home:Computer:
* PROJ Rigetti :Computer:
- Read papers by Eyob and [[https://scholar.google.com/citations?user=oonQr0UAAAAJ&hl=en][Stefano Poletto]]
- Talk - they'll want to see how you communicate with experimentalists/everyone
- Whiteboard questions - kinda like qual exam
** WAIT Next interview steps
   DEADLINE: <2026-06-29 Mon>
** TODO Find Rigetti papers to read
** DONE Send follow-up email
* PROJ Set up habit tracker :Computer:
- Brushing Asher's teeth
- Flea tick heartworm
- Walking/running
- Meds
- Meditation
- Getting into work at a decent time?
- Waking up at a good time
- Watering plants
- CSA pickup
- CSA selection
- Cleaning
- Org journal
- Keep in touch with important people
  - Mom & Pops
  - Droob
  - Sambert
- GTD weekly review
  - Touch base with Anne about her schedule for the week
- Go through mail
** TODO Look at Organice's habit tracker tutorial again
*** TODO Then figure out how to use it in regular org mode
* PROJ Plan camping trip :Computer:
** WAIT Get Grant & Ford's availability
   SCHEDULED: <2026-06-24 Wed>
** WAIT Decide on date and location
* PROJ Iceland prep :Computer:
  SCHEDULED: <2026-07-08 Wed>
** Dates: <2026-07-08 Wed>--<2026-07-17 Fri>:Computer:
** TODO Book rental car for Iceland :Computer:
   DEADLINE: <2026-06-23 Tue>
** TODO Figure out what I need to buy still
- [ ] Rain pants
- [ ] Long johns
** DONE Board boochie for Iceland :Computer:
* PROJ Org Mode / GTD improvements :Computer:
** TODO [[https://www.labri.fr/perso/nrougier/GTD/index.html][Rougier's Org Mode GTD]]
   :LOGBOOK:
   CLOCK: [2026-06-22 Mon 16:26]--[2026-06-22 Mon 16:51] =>  0:25
   :END:
** TODO [#A] [[https://blog.jethro.dev/posts/org_mode_workflow_preview/][Jethro's Org Mode workflow]]
   :LOGBOOK:
   CLOCK: [2026-06-24 Wed 16:39]--[2026-06-24 Wed 16:40] =>  0:01
   CLOCK: [2026-06-24 Wed 16:38]--[2026-06-24 Wed 16:39] =>  0:01
   :END:
Author of Org Roam
** PROJ [[https://www.orgroam.com/manual.html][Org Roam]]
*** TODO Read through manual
*** TODO Take some notes from [[*\[\[https://www.youtube.com/playlist?list=PLhXZp00uXBk4np17N39WvB80zgxlZfVwj\]\[Zaiste Doomcasts\]\]][Zaiste Doomcasts]]
*** TODO Watch [[https://www.youtube.com/watch?v=DbsAQSIKQXk][No Boilerplate's Obsidian videos]] for inspo
** PROJ [[https://desmondrivet.com/2023/12/05/gtd-org-mode][Fancy Org Mode Setup]]
*** TODO Custom org-todo keywords :Home:
#+begin_src elisp
(setq org-todo-keywords
      '((sequence "TODO(t)" "WAIT(w)" "PROJ(p)" "|" "DONE(d)" "CANC(c)")
        ))
#+end_src
**** TODO At Home :Home:
**** TODO At Work :Work:
** TODO Finish [[https://organice.200ok.ch/sample][Organice tutorial]] :Phone:
** PROJ Org Capture
*** TODO Set up capture templates
- Inbox
- Project
*** TODO Make sure that's working on Organice
** PROJ Org Agenda
*** TODO Find another tutorial about it
*** TODO Look into org-super-agenda
*** TODO How to format times as 12hr times
** PROJ Org Journal
*** TODO Set up journal directory to be synced
** PROJ Org crypt
Keep personal notes/journal encrypted
*** TODO Figure out how to use
** PROJ How to set up reading list?
*** GTD book
*** Joy of Abstraction
*** Bullshit Jobs
** TODO Turn off word suggestions in org/text modes
** TODO Install LaTeX and other packages necessary for LaTeX preview in org mode :Home:
** TODO Check out [[https:/orgro.org][Orgro]] :Phone:
** TODO Check out [[https://apps.apple.com/us/app/beorg-to-do-list-agenda/id1238649962][beorg]] :Phone:
** https://lists.gnu.org/archive/html/emacs-orgmode/2007-12/msg00281.html
#+begin_quote
One reason people try out GTD is because they want to get more work
done, because they feel they are drowning in a sea of information,
emails, projects etc, and want to get it all under control.  It is
therefore an exquisite irony that some of these people then spend half
their time surfing the net to try to find out how to do GTD better!
#+end_quote
** TODO How to hide org mode formatting stuff (like /italic/ slashes) :Computer:
* PROJ Doctor appts :Computer:
** TODO Schedule doctor's appt :Computer:
** TODO Schedule eye exam :Computer:
** TODO Look into transferring meds :Computer:
** TODO Look into ADHD treatment through Kaiser :Computer:
- Apparently it's not so straightforward
* PROJ Asahi Linux Setup :Computer:
** TODO Bring my Nix flake over to Asahi
** TODO Install Zen Browser
*** TODO [[https://addons.mozilla.org/en-US/firefox/addon/idle-tab-sweeper/][With idle tab sweeper]]
*** TODO With 1Password
* PROJ Proton :Computer:
** TODO Figure out message filtering for Proton Mail
* PROJ Kitchen setup :Home:
** TODO Bring up last of kitchen stuff from basement
** PROJ Reason cast iron pan
*** TODO Look up how to reseason (might still have card)
** PROJ Hang knife bar
*** TODO Figure out where to hang bar
* PROJ Organize tools :Home:
** TODO Move tools into tool cabinet
* PROJ Basement pile :Home:
** TODO Go through basement pile by laundry
* PROJ Bird's nest in light fixture :Yard:
** TODO Clear out nest in light fixture
* PROJ Gardening :Yard:
** TODO When/where to move hostas :Anne:
** TODO Decide where to put tree :Anne:
** TODO When/where to plant Jersey Tea bush :Anne:
* PROJ Spray for ticks :Yard:
** TODO Figure out when to spray :Anne:
* PROJ Spray Pachysandra :Yard:
** TODO Figure out when to spray :Anne:
* PROJ Crafting Interpreters :Computer:
** TODO Recall state of cLox
* PROJ Fix PC freezing issue :Home:
** TODO Look up why PC might be freezing
* PROJ Emacs AI setup :Computer:
** TODO Read tutorial/configuration for gptel
* PROJ Portable Doom Config :Computer:
** TODO Set up repo for Doom config
* PROJ Fix sink
** TODO Look up how to fix sink
* PROJ CL ZF arithmetic :Computer:
** TODO Make/find "set" object/struct in zf.lisp
Abstract interface enabling set operations:
- [ ] Test membership
- [ ] Add/remove element
- [ ] Union
- [ ] Intersection
- [ ] Difference
- [ ] Symmetric difference (XOR)
Should allow things like sets containing themselves / sets containing everything
* PROJ CL Lambda Calculus BS :Computer:
** TODO Make custom "lambda" object/struct for lambda.lisp
Use macros for more flexibility with function inputs - should be easily able to do things like PLUS * PLUS and end up with a 4-arity function
* PROJ Hang plant shelf & coffee bag
** TODO Get stuff at [[*Home Depot][Home Depot]]
* PROJ complete_subspace :Work:
Add an eigenstate whenever there's an avoided crossing out of the subspace
Or just "track" initial subspace
** DONE Make new branch for complete_subspace
** DONE Assign complete_subspace ticket to myself
** TODO Write function to detect first small singular value
Search each rank individually, then take min index
** TODO Write function to calculate another eigenvector if needed
* PROJ MPO Sum MR :Work:
** WAIT Reviewers
** DONE Address Jason's comments on bond dimension display
** DONE Move mpo_terms to CircuitDMRG's params
   :LOGBOOK:
   CLOCK: [2026-06-26 Fri 12:11]--[2026-06-26 Fri 12:39] =>  0:28
   CLOCK: [2026-06-26 Fri 11:54]--[2026-06-26 Fri 12:05] =>  0:11
   :END:
** DONE Fix bra_op_ket_symbolic
   :LOGBOOK:
   CLOCK: [2026-06-26 Fri 12:39]--[2026-06-26 Fri 12:45] =>  0:06
   :END:
* PROJ Profiling MPO Sums :Work:
** WAIT Check on Tyler's progress
   SCHEDULED: <2026-06-25 Thu 13:00>
* PROJ Groceries :Shopping:
** DONE Berries
** DONE PB
** DONE Brocolli
** DONE Sweet potatoes
** DONE Arugala
** DONE Hummus
** DONE Tofu
** DONE Honey
** DONE Chickpeas
** DONE Canned tomatoes
** DONE My yogurt
** DONE Coconut milk
** DONE Leeks
** DONE Shrooms
** DONE Pasta
** DONE Frozen berries
** DONE Chocolate chips
** DONE Dog food
** DONE Paper towels
* PROJ Target :Shopping:
** TODO Loop earplugs (aisle H31)
* PROJ Howl :Shopping:
* PROJ Home Depot :Shopping:
** DONE Hammer drill
** TODO Impact driver
** TODO Masonry drill bits
** TODO Masonry screws
** DONE Bathroom lightbulb
* PROJ Date nights/ideas
** TODO Find time in schedule for a date night/adventure card :Computer:
* PROJ Circuitizer papers :Work:
** DONE Read through statics paper
** DONE Read through dynamics paper
** DONE Fix typo in dynamics appendix
* PROJ Yogurt on a tombstone
** Outline
- Tuesday night in Baltimore, 165ml of whiskey deep
- Gf took the car to hang out with friends, then texted me asking for ice cream from the grocery store
- I really didn't want to, but she's PMSing and I felt like I couldn't say no (sex issues, she needs me to be supportive)
- Walked 20 min both ways to get ice cream
- Found out later she forgot she had my car
- At first I felt annoyed that she couldn't do it her damn self
- But really just mad at myself for not feeling like I could say no to her
- She could get angry, and I didn't want to have her angry with me
- Throwing the mug - but that was years ago and we worked it out, sort of
- She's from the midwest, people there would probably do this type of shit for each other out of guilt of saying no (but really I'm the one feeling guilty)
- Decided to surpress the feeling as I had already said yes and was nearly there
- Crossed a five(four)-lane road, then had to keep my head down and walk past a screaming tweaker (actually just a lady minding her own biz)
- Got myself nice cheese sticks and yogurt, might as well treat myself if I'm already here (ANNOYED)
- They didn't even have the right kind of ice cream. Told her "They didn't have Cookies & Creme, I'm getting you Milk and Cookies." I texted nicely, but felt much more annoyed
- On the way back I felt disrespected, my relaxing time not worth as much as her time with friends
- How would she feel if I asked her to walk 20 min both ways to get her something (incredibly upset)
- Wouldn't be an issue if she weren't so broke and couldn't afford her own damn car
- Or if she wouldn't ask me to do something that she couldn't easily do for her goddamn self
- But most of all wouldn't be an issue if I had some fucking spine
- The walk went past a graveyard and I (nearly) in a fit of anger threw my yogurt over the fence, where it hit a gravestone
- Immediately sobered up and sprinted down the street
- No one was around, so I got to spend the rest of the walk thinking about what I'd done and feeling embarassed (I sure hope hell isn't real, because I'm definitely going there)
- Eventually she texts that she's on her way home, and "Oh shit I forgot I had the car"
- I could've just reminded her of that and not done any of this
- Immediately start to feel bad about my attitude as well as defiling a grave
- Eventually she gets home, apologizes, says she feels like a dingus
- 
- ???
** Themes
- Boundaries, especially for men with gfs
- How to express emotions like anger without veering into toxic masculinity
- Balance of self-respect and caring for another
- How does the reveal at the end change the context of the whole interaction?
- To what degree is the narrator an asshole? How much does he have a right to be angry?
- Why couldn't he have just said no in the first place?
